benchmarks/results/postgis-20260920T083858Z.txt
PostGIS benchmark
timestamp_utc=20260920T083858Z
database=mapdb
scale=100000
clients=8
duration_seconds=30

## PostGIS version
POSTGIS="3.4.3 e365945" [EXTENSION] PGSQL="160" GEOS="3.9.0-CAPI-1.16.2" PROJ="7.2.1 NETWORK_ENABLED=OFF URL_ENDPOINT=https://cdn.proj.org USER_WRITABLE_DIRECTORY=/var/lib/postgresql/.local/share/proj DATABASE_PATH=/usr/share/proj/proj.db" LIBXML="2.9.10" LIBJSON="0.15" LIBPROTOBUF="1.3.3" WAGYU="0.5.0 (Internal)" TOPOLOGY

## Bulk insert setup and throughput
DROP SCHEMA
CREATE SCHEMA
CREATE TABLE
CREATE TABLE
CREATE TABLE
[...]
INSERT 0 100000
INSERT 0 100000
INSERT 0 100000
INSERT 0 1000
rows_inserted=301000
elapsed_seconds=1.967
rows_per_second=153024.91
CREATE INDEX
CREATE INDEX
CREATE INDEX
[...]
ANALYZE
ANALYZE
ANALYZE
[...]

## Spatial operator plans
### ST_DWithin
                                                               QUERY PLAN                                                                
-----------------------------------------------------------------------------------------------------------------------------------------
 Aggregate  (cost=69.67..69.68 rows=1 width=8) (actual time=0.231..0.232 rows=1 loops=1)
   Buffers: shared hit=6 read=7
   ->  Bitmap Heap Scan on points  (cost=4.44..69.65 rows=10 width=0) (actual time=0.204..0.227 rows=3 loops=1)
         Filter: st_dwithin(geom, '0101000020E610000000000000000000000000000000000000'::geometry, '1'::double precision)
         Rows Removed by Filter: 3
         Heap Blocks: exact=6
         Buffers: shared hit=6 read=7
         ->  Bitmap Index Scan on benchmark_points_geom_gist  (cost=0.00..4.44 rows=4 width=0) (actual time=0.182..0.183 rows=6 loops=1)
               Index Cond: (geom && st_expand('0101000020E610000000000000000000000000000000000000'::geometry, '1'::double precision))
               Buffers: shared read=7
 Planning:
   Buffers: shared hit=196
 Planning Time: 9.319 ms
 Execution Time: 0.346 ms
(14 rows)

### ST_Intersects
                                                                                                                     QUERY PLAN                                                                                                                      
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Aggregate  (cost=8473.11..8473.12 rows=1 width=8) (actual time=1.349..1.350 rows=1 loops=1)
   Buffers: shared hit=428 read=10
   ->  Bitmap Heap Scan on points  (cost=21.02..8471.58 rows=611 width=0) (actual time=0.279..1.311 rows=600 loops=1)
         Filter: st_intersects(geom, '0103000020E6100000010000000500000000000000000024C000000000000024C000000000000024C0000000000000244000000000000024400000000000002440000000000000244000000000000024C000000000000024C000000000000024C0'::geometry)
         Heap Blocks: exact=421
         Buffers: shared hit=428 read=10
         ->  Bitmap Index Scan on benchmark_points_geom_gist  (cost=0.00..20.86 rows=611 width=0) (actual time=0.213..0.213 rows=600 loops=1)
               Index Cond: (geom && '0103000020E6100000010000000500000000000000000024C000000000000024C000000000000024C0000000000000244000000000000024400000000000002440000000000000244000000000000024C000000000000024C000000000000024C0'::geometry)
               Buffers: shared hit=7 read=10
 Planning:
   Buffers: shared hit=188
 Planning Time: 9.643 ms
 Execution Time: 1.470 ms
(13 rows)

### Bounding box
                                                                                                                     QUERY PLAN                                                                                                                     
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Aggregate  (cost=837.14..837.15 rows=1 width=8) (actual time=1.210..1.212 rows=1 loops=1)
   Buffers: shared hit=438
   ->  Bitmap Heap Scan on points  (cost=21.02..835.61 rows=611 width=0) (actual time=0.264..1.169 rows=600 loops=1)
         Recheck Cond: (geom && '0103000020E6100000010000000500000000000000000024C000000000000024C000000000000024C0000000000000244000000000000024400000000000002440000000000000244000000000000024C000000000000024C000000000000024C0'::geometry)
         Heap Blocks: exact=421
         Buffers: shared hit=438
         ->  Bitmap Index Scan on benchmark_points_geom_gist  (cost=0.00..20.86 rows=611 width=0) (actual time=0.181..0.182 rows=600 loops=1)
               Index Cond: (geom && '0103000020E6100000010000000500000000000000000024C000000000000024C000000000000024C0000000000000244000000000000024400000000000002440000000000000244000000000000024C000000000000024C000000000000024C0'::geometry)
               Buffers: shared hit=17
 Planning:
   Buffers: shared hit=116
 Planning Time: 8.881 ms
 Execution Time: 1.323 ms
(13 rows)


## Concurrent query benchmark
CREATE TABLE
INSERT 0 1
pgbench (16.4 (Debian 16.4-1.pgdg110+2))
transaction type: /tmp/pgbench-dwithin.sql
scaling factor: 1
query mode: prepared
number of clients: 8
number of threads: 1
maximum number of tries: 1
duration: 30 s
number of transactions actually processed: 47581
number of failed transactions: 0 (0.000%)
latency average = 5.040 ms
initial connection time = 31.133 ms
tps = 1587.415337 (without initial connection time)
### dwithin latency percentiles
samples=104385
average_ms=4.577
p50_ms=4.488
p95_ms=6.210
p99_ms=7.471
pgbench (16.4 (Debian 16.4-1.pgdg110+2))
transaction type: /tmp/pgbench-intersects.sql
scaling factor: 1
query mode: prepared
number of clients: 8
number of threads: 1
maximum number of tries: 1
duration: 30 s
number of transactions actually processed: 185053
number of failed transactions: 0 (0.000%)
latency average = 1.296 ms
initial connection time = 26.853 ms
tps = 6173.665103 (without initial connection time)
### intersects latency percentiles
samples=185053
average_ms=1.279
p50_ms=1.192
p95_ms=1.743
p99_ms=1.938
pgbench (16.4 (Debian 16.4-1.pgdg110+2))
transaction type: /tmp/pgbench-bbox.sql
scaling factor: 1
query mode: prepared
number of clients: 8
number of threads: 1
maximum number of tries: 1
duration: 30 s
number of transactions actually processed: 39360
number of failed transactions: 0 (0.000%)
latency average = 0.719 ms
initial connection time = 28.383 ms
tps = 11122.599817 (without initial connection time)