benchmarks/results/postgis-20260920T084124Z.txt
PostGIS benchmark
timestamp_utc=20260920T084124Z
database=mapdb
scale=100000
clients=8
duration_seconds=30

## PostGIS version
POSTGIS="3.4.3 e365945" [EXTENSION] PGSQL="160" GEOS="3.9.0-CAPI-1.16.2" PROJ="7.2.1 NETWORK_ENABLED=OFF URL_ENDPOINT=https://cdn.proj.org USER_WRITABLE_DIRECTORY=/var/lib/postgresql/.local/share/proj DATABASE_PATH=/usr/share/proj/proj.db" LIBXML="2.9.10" LIBJSON="0.15" LIBPROTOBUF="1.3.3" WAGYU="0.5.0 (Internal)" TOPOLOGY

## Bulk insert setup and throughput
DROP SCHEMA
CREATE SCHEMA
CREATE TABLE
CREATE TABLE
CREATE TABLE
[...]
INSERT 0 100000
INSERT 0 100000
INSERT 0 100000
INSERT 0 1000
rows_inserted=301000
elapsed_seconds=1.195
rows_per_second=251882.85
CREATE INDEX
CREATE INDEX
CREATE INDEX
[...]
ANALYZE
ANALYZE
ANALYZE
[...]

## Spatial operator plans
### ST_DWithin
                                                                QUERY PLAN                                                                 
-------------------------------------------------------------------------------------------------------------------------------------------
 Aggregate  (cost=37.46..37.47 rows=1 width=8) (actual time=0.251..0.252 rows=1 loops=1)
   Buffers: shared hit=32 read=7
   ->  Index Scan using benchmark_points_geom_gist on points  (cost=0.41..37.44 rows=10 width=0) (actual time=0.162..0.248 rows=6 loops=1)
         Index Cond: (geom && st_expand('0101000020E610000000000000000000000000000000000000'::geometry, '1'::double precision))
         Filter: st_dwithin(geom, '0101000020E610000000000000000000000000000000000000'::geometry, '1'::double precision)
         Rows Removed by Filter: 2
         Buffers: shared hit=32 read=7
 Planning:
   Buffers: shared hit=192 read=6 dirtied=3
 Planning Time: 10.309 ms
 Execution Time: 0.310 ms
(11 rows)

### ST_Intersects
                                                                                                                     QUERY PLAN                                                                                                                      
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Aggregate  (cost=8249.80..8249.81 rows=1 width=8) (actual time=1.514..1.516 rows=1 loops=1)
   Buffers: shared hit=451 read=10
   ->  Bitmap Heap Scan on points  (cost=16.88..8248.31 rows=594 width=0) (actual time=0.330..1.474 rows=593 loops=1)
         Filter: st_intersects(geom, '0103000020E6100000010000000500000000000000000024C000000000000024C000000000000024C0000000000000244000000000000024400000000000002440000000000000244000000000000024C000000000000024C000000000000024C0'::geometry)
         Heap Blocks: exact=444
         Buffers: shared hit=451 read=10
         ->  Bitmap Index Scan on benchmark_points_geom_gist  (cost=0.00..16.73 rows=594 width=0) (actual time=0.234..0.234 rows=593 loops=1)
               Index Cond: (geom && '0103000020E6100000010000000500000000000000000024C000000000000024C000000000000024C0000000000000244000000000000024400000000000002440000000000000244000000000000024C000000000000024C000000000000024C0'::geometry)
               Buffers: shared hit=7 read=10
 Planning:
   Buffers: shared hit=188
 Planning Time: 8.981 ms
 Execution Time: 1.632 ms
(13 rows)

### Bounding box
                                                                                                                     QUERY PLAN                                                                                                                     
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Aggregate  (cost=826.28..826.29 rows=1 width=8) (actual time=1.023..1.024 rows=1 loops=1)
   Buffers: shared hit=461
   ->  Bitmap Heap Scan on points  (cost=16.88..824.80 rows=594 width=0) (actual time=0.229..0.983 rows=593 loops=1)
         Recheck Cond: (geom && '0103000020E6100000010000000500000000000000000024C000000000000024C000000000000024C0000000000000244000000000000024400000000000002440000000000000244000000000000024C000000000000024C000000000000024C0'::geometry)
         Heap Blocks: exact=444
         Buffers: shared hit=461
         ->  Bitmap Index Scan on benchmark_points_geom_gist  (cost=0.00..16.73 rows=594 width=0) (actual time=0.167..0.167 rows=593 loops=1)
               Index Cond: (geom && '0103000020E6100000010000000500000000000000000024C000000000000024C000000000000024C0000000000000244000000000000024400000000000002440000000000000244000000000000024C000000000000024C000000000000024C0'::geometry)
               Buffers: shared hit=17
 Planning:
   Buffers: shared hit=116
 Planning Time: 8.999 ms
 Execution Time: 1.133 ms
(13 rows)


## Concurrent query benchmark
CREATE TABLE
INSERT 0 1
pgbench (16.4 (Debian 16.4-1.pgdg110+2))
transaction type: /tmp/pgbench-dwithin.sql
scaling factor: 1
query mode: prepared
number of clients: 8
number of threads: 1
maximum number of tries: 1
duration: 30 s
number of transactions actually processed: 50267
number of failed transactions: 0 (0.000%)
latency average = 4.772 ms
initial connection time = 19.038 ms
tps = 1676.286520 (without initial connection time)
### dwithin latency percentiles
samples=50267
average_ms=4.756
p50_ms=4.716
p95_ms=6.449
p99_ms=7.414
pgbench (16.4 (Debian 16.4-1.pgdg110+2))
transaction type: /tmp/pgbench-intersects.sql
scaling factor: 1
query mode: prepared
number of clients: 8
number of threads: 1
maximum number of tries: 1
duration: 30 s
number of transactions actually processed: 140086
number of failed transactions: 0 (0.000%)
latency average = 1.712 ms
initial connection time = 30.475 ms
tps = 4673.964875 (without initial connection time)
### intersects latency percentiles
samples=140086
average_ms=1.690
p50_ms=1.679
p95_ms=2.309
p99_ms=2.795
pgbench (16.4 (Debian 16.4-1.pgdg110+2))
transaction type: /tmp/pgbench-bbox.sql
scaling factor: 1
query mode: prepared
number of clients: 8
number of threads: 1
maximum number of tries: 1
duration: 30 s
number of transactions actually processed: 309035
number of failed transactions: 0 (0.000%)
latency average = 0.776 ms
initial connection time = 27.290 ms
tps = 10310.213535 (without initial connection time)
### bbox latency percentiles
samples=309035
average_ms=0.753
p50_ms=0.725
p95_ms=1.074
p99_ms=1.297

## Memory-sensitive join plan
### PostgreSQL memory before join
postgres_rss_kb=
### Join plan and buffer consumption
                                                                       QUERY PLAN                                                                        
---------------------------------------------------------------------------------------------------------------------------------------------------------
 Aggregate  (cost=135492.24..135492.25 rows=1 width=8) (actual time=34.489..34.491 rows=1 loops=1)
   Buffers: shared hit=4231 read=412
   ->  Nested Loop  (cost=0.70..135457.21 rows=14013 width=0) (actual time=8.093..34.334 rows=1000 loops=1)
         Buffers: shared hit=4231 read=412
         ->  Index Scan using points_pkey on points p1  (cost=0.29..42.40 rows=1035 width=32) (actual time=0.056..0.256 rows=1000 loops=1)
               Index Cond: (id <= 1000)
               Buffers: shared hit=13
         ->  Index Scan using benchmark_points_geom_gist on points p2  (cost=0.41..130.74 rows=10 width=32) (actual time=0.023..0.025 rows=1 loops=1000)
               Index Cond: (geom && st_expand(p1.geom, '0.01'::double precision))
               Filter: st_dwithin(p1.geom, geom, '0.01'::double precision)
               Buffers: shared hit=4218 read=412
 Planning:
   Buffers: shared hit=215
 Planning Time: 11.739 ms
 JIT:
   Functions: 10
   Options: Inlining false, Optimization false, Expressions true, Deforming true
   Timing: Generation 0.578 ms, Inlining 0.000 ms, Optimization 0.344 ms, Emission 7.324 ms, Total 8.246 ms
 Execution Time: 58.107 ms
(19 rows)

### PostgreSQL memory after join
postgres_rss_kb=